<?php

$_['text_error_req'] = 'حقل %s فارغ يجب ان يحتوي علي قيمة';
$_['text_error_eq'] = 'حقل %s يجب ان تكون قيمته تساوي %s';
$_['text_error_eqField'] = 'حقل %s يجب ان تكون قيمته متساوية مع حقل %s';
$_['text_error_num'] = 'حقل %s يجب ان يكون رقم فقط';
$_['text_error_int'] = 'حقل %s يجب ان يكون رقم صحيح';
$_['text_error_float'] = 'حقل %s يجب ان يكون رقم عشري';
$_['text_error_alpha'] = 'حقل %s يجب ان يحتوي علي احرف فقط';
$_['text_error_alphanum'] = 'حقل %s يجب ان يحتوي علي احرف و ارقام فقط';
$_['text_error_lt'] = 'حقل %s يجب ان يكون اقل من %s';
$_['text_error_gt'] = 'حقل %s يجب ان يكون اكثر من %s';
$_['text_error_min'] = 'حقل %s يجب ان تكون قيمته اقل من %s (أحرف ان كان نصيا)';
$_['text_error_max'] = 'حقل %s يجب ان تكون قيمته لا تتعدي %s (احرف ان كان نصيا)';
$_['text_error_between'] = 'حقل %s يجب ان تكون قيمته ما بين %s و %s (أحرف ان كان نصيا)';
$_['text_error_floatLike'] = 'حقل %s يجب ان يكون رقم عشري مكون من %s قبل العلامه العشرية و %s بعد العلامه العشرية';
$_['text_error_vdate'] = 'حقل %s يجب ان يكون تاريخ بتنسيق (YYYY-mm-dd)';
$_['text_error_email'] = 'حقل %s يجب ان يكون بريدا الكتورنيا مثال : someone@mail.com';
$_['text_error_url'] = 'حقل %s يجب ان يكون رابط صحيح مثال : http://www.example.com';
